EventSamples/ALERT.WikiSensor.ArticleAdded/a4.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap:Header>Header</soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.Wikisensor.ArticleAdded</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/wikisensor</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:p="http://www.alert-project.eu/panteon" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>WikiSensor</ns1:sender>
              <ns1:timestamp>1350462497259</ns1:timestamp>
              <ns1:sequencenumber>1</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1350462497259</ns1:startTime>
                <ns1:endTime>1350462497259</ns1:endTime>
                <ns1:eventName>ALERT.WikiSensor.ArticleAdded</ns1:eventName>
                <ns1:eventId>w1350462497259</ns1:eventId>
                <ns1:eventType>Request</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <r2:wikiSensor>
                  <r2:source>Optimis</r2:source>
                  <r2:url><![CDATA[http://techbase.kde.org/Development/Architecture/KDE4/Solid_(es)]]></r2:url>
                  <r2:title><![CDATA[Development/Architecture/KDE4/Soli.]]></r2:title>
                  <r2:rawText><![CDATA[Jump to: navigation , search
Interacción hardware sin fisuras
Con Solid, Los desarrolladores de KDE son capaces de escribir facilmente aplicaciones que interaccionan con características del hardware. La abstracción necesaria para soportar el desarrollo de aplicaciones multiplataforma es proporcionada de forma clara y comprensiva por la API de Solid.
Solid no tiene como objetivo el control de los dispositivos (no te permite sincronizar tu teléfono móvil con tu libreta de direcciones local): Solid *busca* dispositivos y te proporciona acceso a la información de estos. De esta manera, puedes mirar fácilmente las funciones de la cpu, o el controlador que maneja tu cámara, o el punto de montaje de tu lápiz usb. En suma: te da la posibilidad de "ver sin tocar" tus dispositivos.
Ahora te preguntas (al menos, yo me pregunté): "¿Por que debería necesitar esta biblioteca?" Quiero controlar el hardware disponible, no mirarlo solamente!"
Bien, Solid te ayuda un montón otra vez: para cualquier interfaz de dispositivo, te da abundante información para acceder a ella fácilmente, usando otras bibliotecas o "pilas". De esta manera, si quieres utilizar tu cámara, puedes usar Solid para reconocerla (puedes usar Solid::Notifier, que te permitirá saber cuando la cámara ha sido conectada) y luego puedes preguntar a Solid para que te la información necesaria para manejarla, por ejemplo con GPhoto o cualquier otra biblioteca que puedas pensar. Del mismo modo se aplica a cualquier otro dispositivo conectado: tarjetas DVB (una vez reconocidas, Solid te proporciona el nombre del dispositvo asociado), tarjetas de sonido (puedes usar ALSA, OSS o el que prefieras: Solid conoce los datos para acceder a ellas), reproductores multimedia portátiles, tarjetas de red, etcétera. Además, te permite comprobar si estás conectado a alguna red o no, y puedes usar Solid para decirle al sistema como conectarse (es decir, puedes preguntar a Solid: "Dame acceso a la red, no quiero preocuparme de los detalles").
De todas maneras, hay otras cosas que se deben decir sobre los dispositivos de red y Bluetooth. Para estas dos clases de dispositivos, Solid proporciona el namespace "Control": es decir, te permite controlarlos directamente, sin usar bibliotecas externas. Esto significa que con Solid, puedes manejar incluso tus interfaces de red inalámbrica o de red con cable, asociarla a un essid, y elegir la configuración ip para ella. También puedes acceder a tu teléfono a través de Bluetooth, etcétera.
La lista de componentes de Solid reside en kdelibs, mientras que el namespace Control está en kdebase.
]]></r2:rawText>
                  <r2:user>
                    <r2:id></r2:id>
                    <r2:name></r2:name>
                    <r2:email></r2:email>
                    <r2:editCount></r2:editCount>
                  </r2:user>
                  <r2:comment></r2:comment>
                  <r2:isMinor>false</r2:isMinor>
                </r2:wikiSensor>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>